package thread.daemons;

/**
 * Created by Grinyov Vitaliy on 25.08.15.
 *
 *
 * запуск и выполнение потока-демона
 *
 * Потоки-демоны используются для работы в фоновом режиме вместе с про-
 граммой, но не являются неотъемлемой частью логики программы. Если ка-
 кой-либо процесс может выполняться на фоне работы основных потоков вы-
 полнения и его деятельность заключается в обслуживании основных потоков
 приложения, то такой процесс может быть запущен как поток-демон. С помо-
 щью метода setDaemon(boolean value), вызванного вновь созданным потоком
 до его запуска, можно определить поток-демон. Метод boolean isDaemon() по-
 зволяет определить, является ли указанный поток демоном или нет.
 */
public class SimpleThread extends Thread {
    public void run() {
        try {
            if (isDaemon()) {
                System.out.println("старт потока-демона");
                Thread.sleep(10_000); // заменить параметр на 1
            } else {
                System.out.println("старт обычного потока");
            }
        } catch (InterruptedException e) {
            System.err.print(e);
        } finally {
            if (!isDaemon()) {
                System.out.println("завершение обычного потока");
            } else {
                System.out.println("завершение потока-демона");
            }
        }
    }
}
